tap "can1357/tap"

# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"

# Diff that understands syntax
brew "difftastic"

# GNU Privacy Guard (OpenPGP)
brew "gnupg"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Tiny, lightning fast, feature-packed file manager
brew "nnn"

# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"

# File system client based on SSH File Transfer Protocol
brew "sshfs"

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"

# Coding agent with the IDE wired in
brew "can1357/tap/omp", trusted: true

# Fonts
cask "font-0xproto-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-ubuntu-nerd-font"
